Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: Let's say it's a nerve cell or a neuron, just to make it all fit together in this context.
ht: An n di li se yon selil nè ki desann nan ou ewonn yon, jis pou fè l' tout ou anfòm ansanm nan kontèks sa a.

source: And we know it's more positive on the outside than the inside.
ht: E nou konnen l, plis pozitif sou a deyò ke à la.

source: We know that there's a lot of sodium on the outside or a lot more sodium on the outside than on the inside.
ht: Nou konnen ke genyen anpil odyòm sou deyò ou anpil odyòm plis sou deyò pase vlope tripay la.

source: There might be a little bit.
ht: Ka gen yon ti bit.

source: And we know there's a lot more potassium on the inside than the outside, but we know generally that the outside is more positive then the inside because our sodium potassium pump will pump out three sodiums for every two potassiums it takes in.
ht: E nou konnen pa gen anpil Potasyòm vlope tripay la pase deyò, men, nou konnen jeneralman deyò se plis pozitif lè sa a l' a paske nou Potasyòm Sodyòm ponp Sera pompe soti twa sodiums pou chak de li pwan nan potassiums.

source: Now in the last video, I told you that there are these things called-- well, we could call them a sodium gate.
ht: Koulye a nan videyo dènye a, mwen di ou ke genyen sa yo bagay te rele - byen, nou te kapab rele yo yon baryè Sodyòm.

source: A sodium ion gate, right?
ht: Yon odyòm ion baryè, dwat?

source: These are all ions.
ht: Se sa yo tout ions.

source: They're charged.
ht: Yo ap akize.

source: Now let's say that there's some reason, some stimulus--
ht: Koulye a, an n di ke pa gen kèk rezon, kèk rezon- kite m' étiquette sa a.

source: That right there is my sodium ion gate.
ht: Isit-la-se baryè ion odyòm m.

source: And it's in its closed position, but let's say something causes it to open.
ht: Se nan pozisyon li fèmen pòt, men an n di yon bagay lakòz li pou louvri.

source: We'll talk maybe in this video or maybe this video and the next about the different things that could cause it to open.
ht: N a pale pètèt nan videyo sa a ou gen dwa sa a videyo Et la kap vini sou tout lòt bagay ki te kapab koz li pou louvri.

source: Maybe it's some type of stimulus causes this to open.
ht: Gen dwa de motif se lakòz sa a pou louvri.

source: Actually, there's a whole bunch of different stimuluses that would cause it to open.
ht: Aktyèlman, gen yon pakèt tout moun diferan stimuluses sa ta koze li pou louvri.

source: But let's say it opens.
ht: Men, ann di li te ouvè.

source: What's going to happen if it opens?
ht: Sa ki pwal pase si li te ouvè?

source: So let's say we open it.
ht: Se konsa nou di nou louvri l.

source: Some stimulus opens-- what's going to happen?
ht: Kèk rezon s'-sa ki pwal pase?

source: We have more positive on the outside than the inside, so positive things want to move in.
ht: Nou gen plis pozitif sou deyò pase à la, se konsa pozitif bagay nou vle pou avanse.

source: And this is a sodium gate so only sodium can go through it.
ht: Et sa a se yon baryè odyòm pou sèl odyòm ka pase ladan l.

source: So it's kind of a convoluted protein structure that only sodium can make its way through.
ht: Se poutèt sa ti jan yon pwoteyin compliquée estrikti sa sèlman odyòm kapab fè li kò yo nan mitan.

source: And on top of that, we have a lot more sodium on the outside than on the inside.
ht: Yo ak sou dèyè, nou pa gen anpil odyòm sou deyò pase sou anndan.

source: So the diffusion gradient's going to want to make sodium go through it.
ht: Se konsa dégradé piblikasyon an pwal vle fè Sodyòm pase nan mitan l.

source: And the fact that sodium's a positive ion, the outside is more positive, they're going to want to run away from that positive environment.
ht: Et fait odyòm a yon ion pozitif, deyò se plis pozitif, yo pwal vle pou yo kouri kite sa anviwònman pozitif.

source: So if you open this, you're just going to have a lot of sodium ions start to flood through.
ht: Se konsa si ou louvri men ou sèlman pwal gen anpil odyòm ions kòmanse pou inondations à. Koulye a menm jan sa rive, sa ki pwal pase si nou ale plus desann len a?

source: Let's zoom out.
ht: An n rale.

source: So let's say that this is my membrane right there.
ht: Se konsa nou di ke sa se len m' la a.

source: Let's say that this is my open gate right here and that it's open for some reason and a bunch of sodium is flowing in.
ht: An n di ke sa se mwen louvri baryè isit-menm Et se louvri pou kèk rezon ak yon pakèt moun odyòm koule tankou dlo nan.

source: So all of this is becoming much more positive.
ht: Se konsa tout sa vin pi plis pozitif.

source: Let's say we had a voltmeter right here.
ht: An n pale nou te genyen yon voltmètre droit isit la.

source: We're measuring the potential difference between the inside of the membrane a and the outside.
ht: Nou ap mezire gwo diferans ant à la de len a yon Et la deyò.

source: Let me do a little chart.
ht: Se pou m' fè yon ti graphique.

source: I'm going to do the chart here on my voltmeter.
ht: M pral fè tablo a isit la sou voltmètre m.

source: And this is going to be the potential difference-- or we'll call it the membrane voltage or the voltage difference across the membrane-- and let's say this is time.
ht: Et sa a pral gen gwo diferans - ou n ap rele l' vòltaj len ou vòltaj la diferans Sur la len - Et an n pale sa se tan.

source: Let's say I haven't opened this gate yet.
ht: An n di mwen poko ouvert baryè sa a ankò.

source: So it's in its resting state.
ht: Se poutèt sa nan eta au li.

source: Our sodium potassium pumps are working.
ht: Pompes Potasyòm odyòm nou travay.

source: Things are leaking back and forth, but it's staying at that minus 70 millivolts.
ht: Bagay sont la koule ankò suite, men, li rete nan millivolts 70 moins sa.

source: So that right there is minus 70 millivolts.
ht: Lè sa a droit pa gen moins 70 millivolts.

source: Now as soon as this gate that's way down some other part of the cell opens, what's going to happen?
ht: Koulye a talè kòm baryè sa a ki se fason desann yon lòt pati nan selil a s', sa ki pwal pase?

source: And let's say that's the only thing that's open.
ht: Et an nou di ke se sèl bagay ki louvri.

source: So this, all of a sudden, is going to become more positive.
ht: Se poutèt sa, tout de yon soudaine, ap vin pi pozitif.

source: So positive charges that's already here-- so other positive charges, whether they're sodiums or potassiums, they're going to want to run away from that point because this area hasn't had a flood of positive things.
ht: Se konsa pozitif chaj ki te la deja isit la ki se konsa lòt pozitif akizasyon, si yo ap sodiums ou potassiums, yo pwal vle pou yo kouri kite pwen sa yo paske nan zòn sa a pa te gen yon inondasyon ki pozitif bagay.

source: So it's less positive than this over here.
ht: Poutèt sa pozitif mwens pase sa sou isit la.

source: So maybe we have some potassiums and maybe we have some sodiums.
ht: Se konsa gen dwa nou genyen kèk potassiums Et petèt nou gen kèk sodiums.

source: Everything is going to want to move away from the place where this is opened.
ht: Tout bagay ap vle pou avanse pou ale nan plas kote sa a ouvert.

source: The charge is going to want to move away.
ht: Akizasyon an pwal vle pou avanse pou ale.

source: So as soon as this happens, as soon as we open this gate, we're going to have a movement of positive charge in this direction.
ht: Se konsa tankou talè kòm sa rive, pli vit ke nou louvri baryè sa a, nou pwal gen yon mouvman de pozitif frais nan direksyon sa a.

source: So all of a sudden-- this was at minus 70 millivolts.
ht: Se konsa tout de yon soudaine - sa te nan moins 70 millivolts.

source: So more positive charge is coming its way.
ht: Se konsa plis pozitif frais ap vini fason pa li.

source: Almost immediately, it's going to become less negative or more positive.
ht: Pwèske imedyatman, li pwal devni mwens negatif ou plis pozitif.

source: The potential difference between this and this is going to become less.
ht: Gwo diferans ant sa e sa pwal ran mwens.

source: So this is this point over here.
ht: Se poutèt sa pwen sa a sou isit la.

source: Now if we took this point, if we did the same thing-- if we measured the voltage at this point right here, maybe it was at minus 70 millvolts, maybe a fraction of a minute amount of time later, the positive charge starts affecting it so it becomes more positive, but the effect is diluted, right?
ht: Koulye a, si nou pran pwen sa a, si nou te fè menm bagay la-- si nou yo ka vòltaj la nan pwen sa isit-menm, petèt se te nan moins 70 millvolts, petèt yon fraksyon de yon montan minute de tan pita, frais pozitif kòmanse qui se konsa L' vin pi pozitif, men efè dilué, droit?

source: Because these positive charges, they're going to radiate in every direction.
ht: Paske pozitif chaj sa yo, yo pral gaye nan tout direksyon.

source: So the effect is diluted.
ht: Se konsa, efè dilué.

source: So the effect on this thing is going to be less.
ht: Se konsa efè sou bagay sa a va en moins.

source: It's going to become less positive.
ht: Li pwal devni mwens pozitif.

source: So an electrotonic potential-- what happens is at one point in the cell, a gate opens, charge starts flooding in, and it starts affecting the potential at other parts of the cell.
ht: Se konsa, yon electrotonic potentiel-sa k rive koukouloukou se nan yon pwen nan selil a, yon baryè s', frais commence inondations nan, Et li commence ki afekte potentiel lòt pati nan selil a.

source: But the positive of it is, it's very fast.
ht: Men pozitif de l, li trè vit.

source: As soon as this happens. further down the cell, it starts becoming more and more positive, but the further you go, the effect gets dissipated with distance.
ht: Kòm ke sa k rive koukouloukou. plus desann sèlil a, li commence vin pi byen toujou pozitif, men, le plus ou ale, efè obtient se ak byen lwen.

source: So if you care about speed, you'd want this electrotonic potential.
ht: Se konsa, si ou swen sou vitès, ou ta vle sa potentiel electrotonic.

source: As soon as it happens, it'll start affecting the rest of the cell, but if you wanted this potential change to travel over large distances-- for example, let's say if we got all the way to this point of the neuron and we wanted to measure it, it might not have any impact.
ht: Kòm ke l' rive, li ap kòmanse Sur tout rès selil a, men si ou te vle gwo chanjman sa a pou vwayaj sou gwo distances - pou egzanp, an n di si nou yo te pran tout chemen pou sa a pwen ewonn a ak nou vle mezire li, li te ka pa gen okenn enfliyans.

source: Maybe a little bit later, but it's not having any impact because all of this gets diluted by the time it gets-- it's increasing the charge throughout the cell.
ht: Petèt yon ti kras pi ta, men, li pa gen okenn enfliyans Paske, tout sa gen dilué pa lè li vin- bouton an gaye akizasyon an atravè sèlil a.

source: So it's a impact far away from the initial place where the gate opened.
ht: Se konsa, li se yon enpak lwen de kote inisyal kote a baryè ouvert.

source: It's going to be a lot less.
ht: Sa ap fè anpil mwens.

source: So it's really not good for operating over distance.
ht: Poutèt sa vrèman pa bon pou opere sou byen lwen.

source: Now let's try to figure out what's going on with an action potential.
ht: Koulye a an n fè efò pou evalye sa k ap pase ak yon aksyon potentiel.

source: And you might understand, this might involve more action.
ht: Et, ou te ka konprann sa a te enplike plis aksyon.

source: So let's start off with the same situation.
ht: Se konsa nou kòmanse avèk menm sitiyasyon an.

source: We have a sodium gate that gets opened by some stimulus.
ht: Nou gen yon baryè odyòm obtient te ouvè pou kèk rezon.

source: What I'm going to do-- let me draw two membranes here.
ht: Kisa mwen pwal fè - kite m' trase de membranes isit la.

source: So this is the outside.
ht: Se poutèt sa a deyò. Sa se à la.

source: And let me draw-- maybe we're dealing with a-- and we'll go in more detail.
ht: Kite m' attirer - petèt nou ap gen pou wè ak yon - ak nou ap vin an plis detay.

source: Maybe this is an axon or something, but let me-- let's say we have another sodium gate right here.
ht: Gen dwa sa a se yon axon oswa yon lòt bagay, men, kite m - an n yo di nou gen yon lòt odyòm baryè droit isit la. Et puis yo ap altène, esansyèlman.

source: So they're alternating so then I have another sodium gate.
ht: Se konsa yo ap altène se konsa lè sa a mwen gen yon lòt odyòm baryè. Mwen pa vle fè yon pakèt moun sa yo.

source: I think I just have to draw one round of it for you to get what's going on.
ht: Mwen panse ke mwen senpleman gen pou fè yon tou de men l' pou nou vin sa k ap fèt.

source: Let me draw another potassium gate.
ht: Kite m' fè yon lòt Potasyòm baryè. Et, an n di yo tout kòmanse fèmen pòt.

source: So they're all in the closed position.
ht: Se konsa yo ap tout nan kan yo fèmen pòt la.

source: Now let's say that this sodium gate gets stimulated.
ht: Koulye a Ann di ke sa a gate odyòm obtient encouragé.

source: It gets opened.
ht: Li jwenn te louvwi. An n di nèg sa a isit-la-l' ouverture.

source: It gets stimulated by something to get opened.
ht: Li jwenn stimuler pa yon bagay pou jwenn ouvert.

source: We'll talk about the things that-- let's say in particular this thing gets opened-- let's say the stimulus-- it has to be a certain voltage.
ht: N a pale sou tout bagay sa ki an n pale an patikilye bagay sa a obtient ouvert - an n ap di a kòz-li gen pou l être yon vòltaj.

source: And let's say they become open when we are at minus 55 millivolts.
ht: An n pale yo vin louvri lè nou nan moins 55 millivolts.

source: So when we're just in our resting state, the potential difference between the inside of the cell and the outside is minus 70, so it's not going to be open.
ht: Se konsa, lè nou ap jis nan nou eta Repos, de diferans ant anndan sèlil a ak deyò se moins 70, se konsa li pa pwal y' a louvri.

source: It's going to be closed, but if for whatever reason, this becomes positive enough to get to minus 55 millivolts, all of a sudden this thing will be open.
ht: Li pwal fèmen, men si se poutèt tou sa, sa devient pozitif ase pou ale moins 55 milyon millivolts, tout de sanzatann yon bagay sa a y' a louvri.

source: Let's write a couple of other rules that dictate what happens to this gate.
ht: An n ekri yon koup lòt règleman bouch epi pase lòd sa k rive koukouloukou baryè sa a.

source: Let's say it closes-- and these are all rough numbers, but the main idea is for you to get the general idea.
ht: An n l' di se - Et se sa yo rele tout pale anpil, Men pi gwo lide a, se pou nou vin konnen jeneral la.

source: Let's say it closes at-- I don't know-- plus 35 millivolts.
ht: An n pale li se nan - mwen pa konnen ki plus 35 millivolts.

source: And let's say that our potassium gate opens at plus 40 millvolts, just to give an idea of things.
ht: An n pale nou baryè Potasyòm s' nan plis 40 millvolts, jis pou l ' konnen yon bagay.

source: Let's say it closes at-- I don't know-- minus 80 millivolts.
ht: An n pale li se nan - mwen pa konnen - moins 80 millivolts. Se poutèt sa ki pwal pase?

source: Lets say that, for whatever reason, the voltage here has now become minus 55.
ht: Pa janm di sa a, se poutèt tou sa, vòltaj la isit la a Koulye a vin moins 55.

source: Let me do a chart just like I did down here.
ht: Se pou m' fè yon graphique egzateman tankou mwen te desann isit la.

source: So I want to have space to draw my chart.
ht: Se konsa mwen vle fè plas pou yo fè m' graphique. Sa se len vòltaj.

source: And this is time down here.
ht: Et, sa se lè li desann isit la.

source: And let's say we're measuring it-- let's say this is the membrane voltage at-- let's say right by the sodium gate right here.
ht: An n pale nou ap mezire li-an nou di se sa a len vòltaj nan - Ann di dwa pa baryè Sodyòm a isit-menm.

source: So we're measuring this voltage across this right here.
ht: Se konsa nou ap mezire vòltaj sa a dans sa a isit.

source: So if it's not stimulated any way, we're just here, flatlining at minus 70 millivolts-- and let's say some stimulus, for whatever reason, makes this more positive.
ht: Se konsa si li te stimuler pa okenn fason, nou isit jis, la flatlining nan moins 70 millivolts - an n ap di: kèk rezon, se poutèt tou sa, sa fè plis pozitif.

source: Maybe it's some type of electrotonic effect that's making it more positive here.
ht: Gen dwa se yon kalite effet electrotonic sa se afè fè l' tounen plis pozitif isit la.

source: Maybe some positive charges are floating by.
ht: Gen dwa gen kèk chaj pozitif sont flotan pa.

source: So this becomes more positive.
ht: Se konsa, sa vin pi pozitif.

source: So let's say this becomes more positive and then the ATP pumps-- the sodium potassium pumps pump it out so it doesn't get to the threshold of minus 55, so then nothing will happen, right?
ht: Se konsa nou di sa devient plis pozitif Et puis ATP la pompes - pompes Potasyòm Sodyòm pompe li soti pou l' pa gen pou seuil de moins 55, se konsa puis anyen ap rive, droit?

source: It didn't get to the threshold.
ht: Li pa t ale devan pòt la.

source: But then let's say there's another electrotonic or maybe a bunch of them and just there's a lot of positive charge here so we get to the minus 55 millvolts.
ht: Men lè sa a nou di se yon lòt electrotonic ou gen dwa yon pakèt moun sèlman ak yo, n' a gen anpil pozitif frais isit la pou nou ale moins 55 milyon millvolts.

source: Remember, when positive charge comes by, we become less negative.
ht: Pa bliye, lè pozitif frais est bò la, nou devni pwodiktè ki mwens negatif.

source: The potential difference becomes less negative.
ht: Gwo diferans devient mwens negatif.

source: We get to that minus 55 volts-- this thing opens then, right?
ht: Nou jwenn sa moins 55 milyon volts - sa bagay s' lè sa a, droit?

source: This was closed before.
ht: Sa te fèmen devan.

source: It was closed when we were just at minus 70.
ht: Li te fèmen lè nou te jis nan moins 70.

source: So let me write here.
ht: Se pou m' ekri isit la.

source: So at this point, our sodium gate opens.
ht: Se konsa nan pwen sa a, nou baryè odyòm s'.

source: Now, what's going to happen when our sodium gate opens?
ht: Koulye a, sa ki pwal pase lè nou baryè odyòm s'?

source: When that opens-- we've seen this show before-- all the positively charged sodium is going to go down there, both electric gradient and diffusion gradient, and there's going to flood into the cell.
ht: Lè sa s' - nou te wè sa a montre devan - tout a pozitivman akize Sodyòm pwal desann la a, les dégradé elektrik ak piblikasyon dégradé, Et a la pwal inondations nan selil a.

source: There's so much sodium out there, it's so positive out there, they just want to come in.
ht: Pa gen anpil Sodyòm la, se konsa pozitif deyò la a, yo jis vle antre.

source: So as soon as they hit that threshold, even though this might've only gotten us to minus 55 or maybe minus 50, all of a sudden that gate opens and we have all of this positive charge flooding into the cell.
ht: Se konsa tankou talè kòm yo Sur sa pou sekirite sosyal, menm si sa ka sèlman an nou moins 55 ou gen dwa moins 50, tout de yon soudaine baryè sa s' Et nou gen tout sa pozitif frais inondations nan selil a.

source: So the potential difference becomes much, much more positive.
ht: Se konsa, gwo diferans est nou pa bezwen, nou pa bezwen plis pozitif.

source: So they keep flooding in, becomes much, much more positive, but as it gets more positive, it closes at plus 35 millvolts.
ht: Se konsa, yo fè inondasyon nan, est bien, nou pa bezwen plis pozitif, men, menm jan li vin pi pozitif, sa se nan plis 35 millvolts.

source: So let's say that we're dealing here-- let's say that this up here is plus 35 millvolts.
ht: Se konsa nou di ke nou ap traiter isit la ki an n ap di sa kanpe isit la se sa plus 35 millvolts.

source: So here it closes and at the same time, that stuff I just deleted-- I set at plus 40 millvolts-- or let's say at plus 35, just for the sake of argument.
ht: Se konsa men li ap fèmen nan dat Et an menm tan an, ki manje mwen sèlman supprimé - mwen mete nan plus 40 millvolts - ou an n di plis 35, jis for the sake of pale anpil.

source: Let's say at plus 45 millvolts, our sodium gates open.
ht: An n pale nan plus 45 millvolts, nou odyòm gates louvri.

source: So what's happened here?
ht: Se konsa sa te pase isit la?

source: All of a sudden, we're at plus 35 or maybe plus 40 millivolts so this is-- let's just say plus 40, I think you get the idea either way so we'll say plus 40-- either way.
ht: Tout de yon soudaine, nou gen nan plus 35 ou gen dwa plus 40 millivolts Se poutèt sa - Ann èspere jis di plus 40, mwen panse ke ou jwenn a idée ni fason sa se konsa n' a pral di plus 40 - ni fason sa.

source: So at plus 40, this guy's going to close.
ht: Se konsa nan plus 40, nèg sa a pwal pou fèmen.

source: No more positive ions are coming in, but now we are at more positive inside, at least locally at this point on the membrane, than we are outside.
ht: Pa pozitif ions gen pou rive, men, koulye a nou nan plis pozitif anndan, omwen lokalman nan pwen sa a sou yon a len, ke nou yo deyò a.

source: And so this gate will open.
ht: Et, se konsa sa a baryè yo ap louvri.

source: So then our sodium gate will open.
ht: Se konsa lè sa a nou Sodyòm baryè a louvri.

source: K-plus ion gate opens.
ht: K-plis ion baryè s'.

source: Now when that opens, what happens?
ht: Koulye a lè sa s', sa k rive koukouloukou?

source: We have all of these sodium ions here.
ht: Nou genyen tout ions odyòm sa yo isit la.

source: We already saw from the sodium potassium pump that the potassium-- we have all of these potassium ions here.
ht: Nou te deja wè de la odyòm Potasyòm pompe sa a Potasyòm - nou genyen tout ions Potasyòm sa yo isit la.

source: We saw from the sodium potassium pump that it makes the sodium concentration on the outside higher and the potassium concentration on the inside higher.
ht: Nou te wè a ponp Potasyòm nan odyòm sa li fè fè de konsantrasyon odyòm a sou deyò plus Et la Potasyòm konsantrasyon vlope tripay la pi wo.

source: And now that we've gotten to this plus 40 millvolt range, we're also now more positive on the inside.
ht: Koulye a, tou pou nou an pou sa plis 40 gamme millvolt nou ap tou koulye a plis pozitif vlope tripay la.

source: So this opens.
ht: Se poutèt sa s'.

source: These guys want to escape because there's
ht: Mesye sa yo vle pou te chape paske pa gen

source: less potassium outside.
ht: Potasyòm mwens deyò.

source: They want to go down their concentration gradient.
ht: Yo vle desann dégradé konsantrasyon yo.

source: It's also very positive on the inside.
ht: Tou trè pozitif vlope tripay la.

source: We're at plus 40 millvolts.
ht: Nou ap nan plus 40 millvolts.

source: So they also want to escape.
ht: Se konsa yo vle tou pou te chape.

source: So they start escaping the cells.
ht: Se konsa yo konmanse ke cellules yo.

source: So positive charges starts exiting the cell from the inside to the outside.
ht: Se konsa pozitif chaj commence sortie sèlil de la L' lan.

source: So we become less positive again.
ht: Se konsa nou vin mwens pozitif ankò.

source: So let me write what happens here.
ht: Se pou m' ekri sa k rive isit la.

source: So at this point, our sodium gate closes and our potassium gate opens.
ht: Se konsa nan pwen sa a, nou odyòm gate se Et Potasyòm nou porte s'.

source: And then the positive charge starts flooding out of the cell again and maybe it'll overshoot because it's only going to close maybe once we get to minus 80 millvolts.
ht: Et puis pozitif akizasyon an commence inondations soti de la selil ankò Et petèt li ap dépassement paske se sèlman pwal pou fèmen petèt yon fwa ke nou ale moins 80 millvolts.

source: So maybe our potassium gate closes at minus 80.
ht: Se konsa petèt nou baryè Potasyòm se nan moins 80.
